//===================================================
//
// 編集モード中のImguiの処理をまとめるクラス [edit.h]
// Author:YUTO YOSHIDA
//
//===================================================

//***************************************************
// 多重インクルード防止
//***************************************************
#ifndef _EDIT_H_
#define _EDIT_H_

//***************************************************
// インクルードファイル
//***************************************************
#include "object.h"

//***************************************************
// 編集モードクラスの定義
//***************************************************
class CEdit : public CObject
{
public:
	CEdit();
	~CEdit();

	static CEdit* Create(void);

	HRESULT Init(void) override;
	void Uninit(void) override;
	void Update(void) override;
	void Draw(void) override;
private:
};
#endif