//==============================================
//
// ゲームの機能の基底クラス [GameSystemBase.h]
// Author:YUTO YOSHIDA
// 
// << 更新等を行う >>
//
//==============================================

//**********************************************
// 多重インクルード防止
//**********************************************
#ifndef _GAME_SYSTEM_BASE_H_
#define _GAME_SYSTEM_BASE_H_

//**********************************************
// インクルードファイル
//**********************************************

//**********************************************
// 機能クラスの定義
//**********************************************
class CSystemBase
{
public:
	CSystemBase();
	virtual ~CSystemBase();

	virtual void Init(void) = 0;
	virtual void Update(void) = 0;
private:
};
#endif
