//================================================
//
// 世界の軸の描画[ViewAxis.h]
// Author: YUTO YOSHIDA
//
//================================================

//************************************************
// 多重インクルード防止
//************************************************
#ifndef _VIEXAXIS_H_
#define _VIEXAXIS_H_

//************************************************
// インクルードファイル
//************************************************
class CViewAxis
{
public:
	~CViewAxis();

	static void Draw(void);
private:
	CViewAxis();
};
#endif