//================================================
//
// 世界の軸の描画[ViewAxis.cpp]
// Author: YUTO YOSHIDA
//
//================================================

//************************************************
// インクルードファイル
//************************************************
#include "ViewAxis.h"
#include "line.h"

//================================================
// コンストラクタ
//================================================
CViewAxis::CViewAxis()
{
}

//================================================
// デストラクタ
//================================================
CViewAxis::~CViewAxis()
{
}

//================================================
// 描画処理
//================================================
void CViewAxis::Draw(void)
{
	// 線の取得
	CLineRenderer* pLine = CLineRenderer::GetInstance();

	if (pLine != nullptr)
	{
		// 線の追加
		pLine->AddLine(Const::VEC3_NULL, D3DXVECTOR3(500.0f, 0.0f, 0.0f), D3DXCOLOR(1.0f, 0.0f, 0.0f, 1.0f));
		pLine->AddLine(Const::VEC3_NULL, D3DXVECTOR3(0.0f, 500.0f, 0.0f), D3DXCOLOR(0.0f, 1.0f, 0.0f, 1.0f));
		pLine->AddLine(Const::VEC3_NULL, D3DXVECTOR3(0.0f, 0.0f, 500.0f), D3DXCOLOR(0.0f, 1.0f, 1.0f, 1.0f));
	}
}
